app/controllers/compras_controller.rb

    def show
        @user = current_user
        @compra = @user.compras.find(params[:id])
---
SELECT "compras".* FROM "compras" WHERE "compras"."user_id" = $1 AND "compras"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

    def new
        @libro = Libro.find(params[:libro_id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @libro = Libro.find(params[:libro_id])
        @user = current_user
        @compra = @user.compras.new(estado: "E")
        @compra.libro = @libro
        if @compra.save
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "compras" ("user_id", "libro_id", "estado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["libro_id", 1], ["estado", "E"], ["created_at", "2023-04-25 22:49:06.137049"], ["updated_at", "2023-04-25 22:49:06.137049"]]

    def edit
        @user = current_user
        @compra = @user.compras.find(params[:id])
---
SELECT "compras".* FROM "compras" WHERE "compras"."user_id" = $1 AND "compras"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

    def update
        @user = current_user
        @compra = @user.compras.find(params[:id])
        if @compra.update(compra_params)
---
SELECT "compras".* FROM "compras" WHERE "compras"."user_id" = $1 AND "compras"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "compras" SET "estado" = $1, "updated_at" = $2 WHERE "compras"."id" = $3  [["estado", "A"], ["updated_at", "2023-04-25 23:00:48.768345"], ["id", 1]]

    def destroy
        @user = current_user
        @compra = @user.compras.find(params[:id])
        @compra.destroy
---
SELECT "compras".* FROM "compras" WHERE "compras"."user_id" = $1 AND "compras"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 7], ["LIMIT", 1]]
DELETE FROM "compras" WHERE "compras"."id" = $1  [["id", 7]]