app/controllers/libros_controller.rb

INSERT INTO "libros" ("titulo", "fecha", "categoria", "autor", "precio", "stock", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @libro = Libro.new(libro_params)
      if @libro.save

SELECT "libros".* FROM "libros"
---
  def index
    @libros = Libro.all

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @libro = Libro.find(params[:id])