app/controllers/mensajes_controller.rb

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        @libro = Libro.find(params[:libro_id])

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "mensajes".* FROM "mensajes" WHERE "mensajes"."libro_id" = $1 AND "mensajes"."id" = $2 LIMIT $3  [["libro_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def show
        @libro = Libro.find(params[:libro_id])
        @mensaje = @libro.mensajes.find(params[:id])

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @libro = Libro.find(params[:libro_id])

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "mensajes" ("texto", "user_id", "libro_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["texto", "hola"], ["user_id", 1], ["libro_id", 1], ["created_at", "2023-04-23 20:25:04.752598"], ["updated_at", "2023-04-23 20:25:04.752598"]]
---
    def create
        @libro = Libro.find(params[:libro_id])
        @mensaje = @libro.mensajes.new(mensaje_params)
        @mensaje.user = current_user
        if @mensaje.save

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "mensajes".* FROM "mensajes" WHERE "mensajes"."libro_id" = $1 AND "mensajes"."id" = $2 LIMIT $3  [["libro_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def edit
        @libro = Libro.find(params[:libro_id])
        @mensaje = @libro.mensajes.find(params[:id])

SELECT "mensajes".* FROM "mensajes" WHERE "mensajes"."user_id" = $1 AND "mensajes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "mensajes" SET "texto" = $1, "updated_at" = $2 WHERE "mensajes"."id" = $3  [["texto", "hola!"], ["updated_at", "2023-04-23 20:25:18.727039"], ["id", 1]]
---
    def update
        @user = current_user
        @mensaje = @user.mensajes.find(params[:id])
        if @mensaje.update(mensaje_params)

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "mensajes".* FROM "mensajes" WHERE "mensajes"."libro_id" = $1 AND "mensajes"."id" = $2 LIMIT $3  [["libro_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "mensajes" WHERE "mensajes"."id" = $1  [["id", 1]]
---
    def destroy
        @libro = Libro.find(params[:libro_id])
        @mensaje = @libro.mensajes.find(params[:id])
        @mensaje.destroy