app/controllers/resenas_controller.rb

    def index
        @libro = Libro.find(params[:libro_id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
        @libro = Libro.find(params[:libro_id])
        @resena = @libro.resenas.find(params[:id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "resenas".* FROM "resenas" WHERE "resenas"."libro_id" = $1 AND "resenas"."id" = $2 LIMIT $3  [["libro_id", 1], ["id", 5], ["LIMIT", 1]]

    def new
        @libro = Libro.find(params[:libro_id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @libro = Libro.find(params[:libro_id])
        @resena = @libro.resenas.new(resena_params)
        @resena.user = current_user
        if @resena.save
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "resenas" ("titulo", "cuerpo", "libro_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["titulo", "prueba"], ["cuerpo", "TODO FUNCIONA :D"], ["libro_id", 1], ["user_id", 2], ["created_at", "2023-04-25 23:22:59.443422"], ["updated_at", "2023-04-25 23:22:59.443422"]]

    def edit
        @libro = Libro.find(params[:libro_id])
        @resena = @libro.resenas.find(params[:id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "resenas".* FROM "resenas" WHERE "resenas"."libro_id" = $1 AND "resenas"."id" = $2 LIMIT $3  [["libro_id", 1], ["id", 4], ["LIMIT", 1]]

    def update
        @user = current_user
        @resena = @user.resenas.find(params[:id])
---
SELECT "resenas".* FROM "resenas" WHERE "resenas"."user_id" = $1 AND "resenas"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 4], ["LIMIT", 1]]

    def destroy
        @libro = Libro.find(params[:libro_id])
        @resena = @libro.resenas.find(params[:id])
        @resena.destroy
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "resenas".* FROM "resenas" WHERE "resenas"."libro_id" = $1 AND "resenas"."id" = $2 LIMIT $3  [["libro_id", 1], ["id", 5], ["LIMIT", 1]]
DELETE FROM "resenas" WHERE "resenas"."id" = $1  [["id", 5]]